#int_research.py
#برنامج وظيفته تحويل النصوص الى اعداد صحيحة
#Documentation source:

#تنجح , لان بايثون يتجاهل تلقائيا المسافات الفارغة المحيطة بالنص قبل التحويل 
print(int("22"),type(int("22")))
#تنجح لان علامة الموجب + تعتبر اشارة رياضية مقبوله لتحديد الاعداد الموجبه 
print (int("+22"),type(int("+22")))
#تنجح لان علامه الموجب + تعتبر اشارة رياضية مقبولة لتحديد الاعداد الموجبة 
print(int("0022"),type(int("0022")))
#تنجح لان الشرطة السفلية _ تستخدم في بايثون كمحدد اختياري لقراءة الارقام الكبيرة بشكل اسهل وتحذف عند التحويل 
print(int("2_2"),type(int("2_2")))

